https://medium.com/bhavaniravi/python-pandas-tutorial-92018da85a33

-------------------------------------------------------------------------------------------------------------------------------

<h2 style="color:green" align="left"> Reading CSV </h2>

In [1]:
import pandas as pd

In [2]:
url = 'C:/Users/deepusuresh/Documents/Data Science/01. Python/1. Practice/2. PANDAS/15. Pandas_All Commands'

df = pd.read_excel("Pandas.xlsx")
df.head(5)

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-05-02  100000       567
1         US  North         Bill       2010-10-31  120000      3000
2         UK  North       Thomas       2018-10-30  140000       345
3  Australia   East         John       2010-04-20  160000      1000
4     Africa   East         Bill       2017-10-24  180000       123

In [3]:
df1 = pd.read_excel("Pandas.xlsx","Q1 Sales")
df1.head(5)

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-05-02  100000       567
1         US  North         Bill       2010-10-31  120000      3000
2         UK  North       Thomas       2018-10-30  140000       345
3  Australia   East         John       2010-04-20  160000      1000
4     Africa   East         Bill       2017-10-24  180000       123

In [4]:
df2 = pd.read_excel("Pandas.xlsx","Q4 Sales")
df2.head(5)

  Country Region Sales Person Date of Purchase     Total  Quantity
0   India   East         John       2011-09-20  26000000       567
1   China  North         Bill       2015-02-04    100000      3000
2      UK   East       Thomas       2018-02-20    120000       345
3   Nepal   East         John       2014-07-25    200000      1000
4  Africa   East         Bill       2017-05-05    220000       123

<h2 style="color:green" align="left"> 1. Understanding Data </h2>

# 1. shows you a gist of the data

        df1.head()

# 2. Some statistical information about your data

        df1.describe()

# 3. List of columns headers

        df1.columns.values

In [5]:
df1.head()

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-05-02  100000       567
1         US  North         Bill       2010-10-31  120000      3000
2         UK  North       Thomas       2018-10-30  140000       345
3  Australia   East         John       2010-04-20  160000      1000
4     Africa   East         Bill       2017-10-24  180000       123

In [6]:
df1.describe()

              Total     Quantity
count  2.000000e+01    20.000000
mean   1.502500e+06   977.900000
std    5.769280e+06  1761.923497
min    1.000000e+05    85.000000
25%    1.400000e+05    90.000000
50%    1.700000e+05   505.500000
75%    2.250000e+05  1000.000000
max    2.600000e+07  7890.000000

In [7]:
df1.columns.values

array(['Country', 'Region', 'Sales Person', 'Date of Purchase', 'Total',
       'Quantity'], dtype=object)

<h2 style="color:green" align="left"> 2. Pick & Choose your Data </h2>

# Indexes

     Indexes are labels used to refer to your data. These labels are usually your column headers.
     For eg., Country, Region, Quantity Etc.,

<h3 style="color:purple" align="left"> a. Selecting Columns </h3>

<h4 style="color:red" align="left"> i) Extract a Single column </h4>

In [8]:
df1[["Total"]]

       Total
0     100000
1     120000
2     140000
3     160000
4     180000
5     200000
6    1000000
7     240000
8   26000000
9     100000
10    120000
11    140000
12    160000
13    180000
14    200000
15    220000
16    240000
17    260000
18    140000
19    150000

<h4 style="color:red" align="left"> ii) Extract Multiple columns </h4>

# 1. Create a list of columns to be selected

        columns_to_be_selected = ["Total", "Quantity", "Country"]

# 2. Use it as an index to the DataFrame

        df1[columns_to_be_selected]

# 3. Using loc method

        df1.loc[[0, 1, 4, 5]]

In [9]:
columns_to_be_selected = ["Total", "Quantity", "Country"]

In [10]:
df1[columns_to_be_selected]

       Total  Quantity    Country
0     100000       567      India
1     120000      3000         US
2     140000       345         UK
3     160000      1000  Australia
4     180000       123     Africa
5     200000      1000  Singapore
6    1000000      7890    Mylasia
7     240000       200      India
8   26000000      1000         US
9     100000      1000         UK
10    120000       567  Australia
11    140000      1000     Africa
12    160000       892  Singapore
13    180000       444    Mylasia
14    200000        90      India
15    220000        90         US
16    240000        90         UK
17    260000        90  Australia
18    140000        85     Africa
19    150000        85  Singapore

In [11]:
df1.loc[[0, 1, 4, 5]]

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-05-02  100000       567
1         US  North         Bill       2010-10-31  120000      3000
4     Africa   East         Bill       2017-10-24  180000       123
5  Singapore   East       Thomas       2013-05-10  200000      1000

<h3 style="color:purple" align="left"> b. Selecting Rows </h3>

#  Unlike the columns, our current DataFrame does not have a label which we can use to refer the row data.

   But like arrays, DataFrame provides numerical indexing(0, 1, 2…) by default.

<h4 style="color:red" align="left"> i) Extract Single Row </h4>

In [12]:
df1.iloc[0:1, :]

  Country Region Sales Person Date of Purchase   Total  Quantity
0   India  North         John       2012-05-02  100000       567

<h4 style="color:red" align="left"> ii) Extract More than one row </h4>

# 1. using numerical indexes - iloc

       df1.iloc[0:3, :]

# 2. using labels as index - loc

       row_index_to_select = [0, 1, 4, 5]
       df1.loc[row_index_to_select]

In [13]:
df1.iloc[0:3, :]

  Country Region Sales Person Date of Purchase   Total  Quantity
0   India  North         John       2012-05-02  100000       567
1      US  North         Bill       2010-10-31  120000      3000
2      UK  North       Thomas       2018-10-30  140000       345

In [14]:
row_index_to_select = [0, 1, 4, 5]
df1.loc[row_index_to_select]

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-05-02  100000       567
1         US  North         Bill       2010-10-31  120000      3000
4     Africa   East         Bill       2017-10-24  180000       123
5  Singapore   East       Thomas       2013-05-10  200000      1000

<h3 style="color:purple" align="left"> c. Filtering Rows </h3>

1. Total sales > 200000
   df1[df1["Total"] > 200000]
   
2. Total sales > 200000 and in UK
   df1[(df1["Total"] > 200000) & (df1["Country"] == "UK")]

In [15]:
df1[df1["Total"] > 200000]

      Country Region Sales Person Date of Purchase     Total  Quantity
6     Mylasia   West         John       2018-11-03   1000000      7890
7       India   West         Bill       2018-01-23    240000       200
8          US   West       Thomas       2012-08-16  26000000      1000
15         US   West         John       2016-10-11    220000        90
16         UK   West         Bill       2018-04-18    240000        90
17  Australia   West       Thomas       2013-04-22    260000        90

In [16]:
df1[(df1["Total"] > 200000) & (df1["Country"] == "UK")]

   Country Region Sales Person Date of Purchase   Total  Quantity
16      UK   West         Bill       2018-04-18  240000        90

<h3 style="color:green" align="left"> 3. Playing With Dates </h3>

#  Most of the times when dealing with date fields we don’t use them as it is. Pandas make it really easy for you to project 

   Date/Month/Year from it and perform operations on top of it. In our sample dataset, the Date_of_purchase is of type string, 
   
   hence the first step would be to convert them to the DateTime type.

In [17]:
type(df1['Date of Purchase'].iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

### a. Converting Column to DateTime Object

In [18]:
df1['Date of Purchase'] = pd.to_datetime(df1['Date of Purchase'])
type(df1['Date of Purchase'].iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

### b. Extracting Date, Month & Year

In [19]:
df1['Date of Purchase'].dt.date

0     2012-05-02
1     2010-10-31
2     2018-10-30
3     2010-04-20
4     2017-10-24
5     2013-05-10
6     2018-11-03
7     2018-01-23
8     2012-08-16
9     2016-12-22
10    2017-07-27
11    2010-03-21
12    2013-02-13
13    2010-04-11
14    2011-01-26
15    2016-10-11
16    2018-04-18
17    2013-04-22
18    2011-10-03
19    2018-08-17
Name: Date of Purchase, dtype: object

In [20]:
df1['Date of Purchase'].dt.day

0      2
1     31
2     30
3     20
4     24
5     10
6      3
7     23
8     16
9     22
10    27
11    21
12    13
13    11
14    26
15    11
16    18
17    22
18     3
19    17
Name: Date of Purchase, dtype: int64

In [21]:
df1['Date of Purchase'].dt.month

0      5
1     10
2     10
3      4
4     10
5      5
6     11
7      1
8      8
9     12
10     7
11     3
12     2
13     4
14     1
15    10
16     4
17     4
18    10
19     8
Name: Date of Purchase, dtype: int64

In [22]:
df1['Date of Purchase'].dt.year

0     2012
1     2010
2     2018
3     2010
4     2017
5     2013
6     2018
7     2018
8     2012
9     2016
10    2017
11    2010
12    2013
13    2010
14    2011
15    2016
16    2018
17    2013
18    2011
19    2018
Name: Date of Purchase, dtype: int64

## 4. Grouping

### Statistical operations

#  You can perform statistical operations such as min, max, mean etc., over one or more columns of a Dataframe.

df1["Total"].sum()
df1[["Total", "Quantity"]].mean()
df1[["Total", "Quantity"]].min()
df1[["Total", "Quantity"]].max()
df1[["Total", "Quantity"]].median()
df1[["Total", "Quantity"]].mode()

In [23]:
df1["Total"].sum()

30050000

In [24]:
df1[["Total", "Quantity"]].mean()

Total       1502500.0
Quantity        977.9
dtype: float64

In [25]:
df1[["Total", "Quantity"]].min()

Total       100000
Quantity        85
dtype: int64

In [26]:
df1[["Total", "Quantity"]].max()

Total       26000000
Quantity        7890
dtype: int64

In [27]:
df1[["Total", "Quantity"]].median()

Total       170000.0
Quantity       505.5
dtype: float64

In [28]:
df1[["Total", "Quantity"]].mode()

    Total  Quantity
0  140000      1000

####  Now in a real-world application, the raw use of these statistical functions are rare, often you might want to group data based on specific parameters and derive a gist of the data.
   

####  Let’s look at an example where we look at the country-wise, country & Region-wise sales.

# 1. Country wise sales and Quantity

       df.groupby("Country").sum()

# 2. Quantity of sales over each country & Region

       df.groupby(["Country", "Region"])["Quantity"].sum()

# 3. More than one aggregation

       df.groupby(["Country", "Region"]).agg(
                     {'Total':['sum', 'max'], 
                      'Quantity':'mean'})

<h3 style="color:blue" align="left"> Groupby Country </h3>

In [29]:
df1.groupby("Country").sum()

              Total  Quantity
Country
Africa       460000      1208
Australia    540000      1657
India        540000       857
Mylasia     1180000      8334
Singapore    510000      1977
UK           480000      1435
US         26340000      4090

<h3 style="color:blue" align="left"> Groupby Country & Region </h3>

In [30]:
df.groupby(["Country", "Region"]).sum()

                     Total  Quantity
Country   Region
Africa    East      180000       123
          North     280000      1085
Australia East      160000      1000
          North     120000       567
          West      260000        90
India     East      200000        90
          North     100000       567
          West      240000       200
Mylasia   East      180000       444
          West     1000000      7890
Singapore East      360000      1892
          North     150000        85
UK        North     240000      1345
          West      240000        90
US        North     120000      3000
          West    26220000      1090

<h3 style="color:blue" align="left"> Just The Quantity </h3>

In [31]:
df1.groupby(["Country", "Region"])["Quantity"].sum()

Country    Region
Africa     East       123
           North     1085
Australia  East      1000
           North      567
           West        90
India      East        90
           North      567
           West       200
Mylasia    East       444
           West      7890
Singapore  East      1892
           North       85
UK         North     1345
           West        90
US         North     3000
           West      1090
Name: Quantity, dtype: int64

<h3 style="color:blue" align="left"> More than one aggregation function </h3>

In [32]:
df1.groupby(["Country", "Region"]).agg({'Total':['sum', 'max'],'Quantity':'mean'})

                     Total           Quantity
                       sum       max     mean
Country   Region
Africa    East      180000    180000    123.0
          North     280000    140000    542.5
Australia East      160000    160000   1000.0
          North     120000    120000    567.0
          West      260000    260000     90.0
India     East      200000    200000     90.0
          North     100000    100000    567.0
          West      240000    240000    200.0
Mylasia   East      180000    180000    444.0
          West     1000000   1000000   7890.0
Singapore East      360000    200000    946.0
          North     150000    150000     85.0
UK        North     240000    140000    672.5
          West      240000    240000     90.0
US        North     120000    120000   3000.0
          West    26220000  26000000    545.0

## 5. Pivot Table

#  Pivot Table is an advanced version of groupby, where you can stack dimensions over both rows and columns.

   i.e., as the data grows the groupby above is going to grow in length and will become hard to derive insights,
   
   hence a well-defined way to look at it would be Pivot tables

In [33]:
import numpy as np
df1.pivot_table(index=["Country"], 
               columns=["Region"], 
               values=["Quantity"], 
               aggfunc=[np.sum])

               sum
          Quantity
Region        East   North    West
Country
Africa       123.0  1085.0     NaN
Australia   1000.0   567.0    90.0
India         90.0   567.0   200.0
Mylasia      444.0     NaN  7890.0
Singapore   1892.0    85.0     NaN
UK             NaN  1345.0    90.0
US             NaN  3000.0  1090.0

#  Another advantage of the Pivot Table is that you can add as many dimensions and functions you want.

   It also calculates a grand total value for you

In [34]:
df1.pivot_table(index=["Country"], 
               columns=["Region","Sales Person"], 
               values=["Quantity"], 
               aggfunc=[np.sum], 
               margins=True,
               margins_name="Grand Total")

                  sum                                                         \
             Quantity
Region           East                   North                   West
Sales Person     Bill    John  Thomas    Bill    John  Thomas   Bill    John
Country
Africa          123.0     NaN     NaN     NaN    85.0  1000.0    NaN     NaN
Australia         NaN  1000.0     NaN   567.0     NaN     NaN    NaN     NaN
India             NaN     NaN    90.0     NaN   567.0     NaN  200.0     NaN
Mylasia         444.0     NaN     NaN     NaN     NaN     NaN    NaN  7890.0
Singapore         NaN   892.0  1000.0    85.0     NaN     NaN    NaN     NaN
UK                NaN     NaN     NaN     NaN  1000.0   345.0   90.0     NaN
US                NaN     NaN     NaN  3000.0     NaN     NaN    NaN    90.0
Grand Total     567.0  1892.0  1090.0  3652.0  1652.0  1345.0  290.0  7980.0



Region               Grand Total
Sales Person  Thomas
Country
Africa           NaN        1208
Australia       90.0        1657
India            NaN         857
Mylasia          NaN        8334
Singapore        NaN        1977
UK               NaN        1435
US            1000.0        4090
Grand Total   1090.0       19558